[rule]
id = "86dff3e8-a87c-4c7e-bd5c-9b0654316c8b"
rule_id = "585480f6-7827-4f20-bbef-19bf2bfcd209"
name = "bat file in http traffic on unusual port"
description = "bat file in http traffic on unusual port"
enabled = false
type = "query"
language = "kuery"
severity = "low"
risk_score = 21
interval = "5m"
from = "now-10m"
to = "now"
max_signals = 100
query = """event.dataset: "zeek.http" and url.extension : bat and not destination.port : 80"""
version = 1
created_at = "2026-05-05T13:48:30.371Z"
updated_at = "2026-05-07T21:07:56.350Z"

[rule.index]
indices = ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"]

[rule.alert_suppression]
group_by = ["source.ip"]
duration_value = 5
duration_unit = "m"
missing_fields_strategy = "suppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[[rule.threat.technique.subtechnique]]
id = "T1059.003"
name = "Windows Command Shell"
reference = "https://attack.mitre.org/techniques/T1059/003/"
