[rule]
id = "44108d38-7703-402c-90ca-4fc0776d6dc8"
rule_id = "35db210f-7dbe-4967-ad08-accaa1658a9f"
name = "data Exfiltration observed via FTP "
description = "zip file sent over ftp"
enabled = false
type = "query"
language = "kuery"
severity = "low"
risk_score = 21
interval = "5m"
from = "now-10m"
to = "now"
max_signals = 100
query = """event.dataset : "zeek.ftp" and event.action : "STOR""""
version = 1
created_at = "2026-05-07T20:55:52.128Z"
updated_at = "2026-05-07T21:07:57.824Z"

[rule.index]
indices = ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"]

[rule.alert_suppression]
group_by = ["destination.ip"]
duration_value = 5
duration_unit = "m"
missing_fields_strategy = "suppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0010"
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"

[[rule.threat.technique]]
id = "T1020"
name = "Automated Exfiltration"
reference = "https://attack.mitre.org/techniques/T1020/"
