[rule]
id = "23e33777-65ec-412b-a486-16663656c501"
rule_id = "d20176a9-bca4-49d3-be9a-91d3489eccfe"
name = "data archive for potential exfil"
description = "data archive for potential exfil"
enabled = false
type = "query"
language = "kuery"
severity = "high"
risk_score = 100
interval = "5m"
from = "now-10m"
to = "now"
max_signals = 100
query = """event.dataset:"endpoint.events.file" and  file.name:(*.zip) and event.action:(creation or overwrite)  and file.path:*\\\\Windows\\\\Temp* and process.name : "powershell.exe""""
version = 1
created_at = "2026-05-07T20:21:58.725Z"
updated_at = "2026-05-07T21:07:59.825Z"

[rule.index]
indices = ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"]

[rule.alert_suppression]
group_by = ["host.hostname"]
duration_value = 5
duration_unit = "m"
missing_fields_strategy = "suppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0009"
name = "Collection"
reference = "https://attack.mitre.org/tactics/TA0009/"

[[rule.threat.technique]]
id = "T1074"
name = "Data Staged"
reference = "https://attack.mitre.org/techniques/T1074/"

[[rule.threat.technique.subtechnique]]
id = "T1074.001"
name = "Local Data Staging"
reference = "https://attack.mitre.org/techniques/T1074/001/"
