[rule]
id = "c2de348e-777e-44fd-b1f3-a640d5651992"
rule_id = "7449c8a1-31b3-492a-82b3-191d0edfcf63"
name = "ps exe via a bat file"
description = "ps exe via a bat file"
enabled = false
type = "query"
language = "kuery"
severity = "low"
risk_score = 21
interval = "5m"
from = "now-10m"
to = "now"
max_signals = 100
query = """event.dataset : "windows.sysmon_operational" and process.command_line: powershell* and process.parent.command_line: *bat* and process.parent.name: cmd*"""
version = 1
created_at = "2026-05-05T13:48:41.347Z"
updated_at = "2026-05-07T21:07:57.072Z"

[rule.index]
indices = ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"]

[rule.alert_suppression]
group_by = ["host.hostname"]
duration_value = 5
duration_unit = "m"
missing_fields_strategy = "suppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[[rule.threat.technique.subtechnique]]
id = "T1059.001"
name = "PowerShell"
reference = "https://attack.mitre.org/techniques/T1059/001/"
