[rule]
id = "e78430cf-13a0-4265-a151-b714ee8f1c9a"
rule_id = "9bb5036f-7f10-4e74-a564-5292b0f432cf"
name = "sus file written to temp dir "
description = "sus file written to temp dir "
enabled = false
type = "query"
language = "kuery"
severity = "low"
risk_score = 21
interval = "5m"
from = "now-10m"
to = "now"
max_signals = 100
query = """event.dataset:"endpoint.events.file" and  file.name:(History or *.txt) and event.action:(creation or overwrite)  and file.path:*\\Windows\\Temp* and process.name : "powershell.exe""""
version = 1
created_at = "2026-05-07T20:17:22.053Z"
updated_at = "2026-05-07T21:08:00.805Z"

[rule.index]
indices = ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"]

[rule.alert_suppression]
group_by = ["host.hostname"]
duration_value = 5
duration_unit = "m"
missing_fields_strategy = "suppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[[rule.threat.technique]]
id = "T1082"
name = "System Information Discovery"
reference = "https://attack.mitre.org/techniques/T1082/"

[[rule.threat.technique]]
id = "T1217"
name = "Browser Information Discovery"
reference = "https://attack.mitre.org/techniques/T1217/"
